РП/src/Documents/ПереоценкаНМА/ПереоценкаНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереоценкаНМА</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ПереоценкаНМАБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияНМАБухгалтерскийУчет</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДооценки</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоначальнаяСтоимостьБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакопленнаяАмортизацияБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииБУ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПереоценкиНакопленнойАмортизацииБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НачисленнаяАмортизация</name>
    <attributes>
      <name>ОбъектУчета</name>
      <type>
        <types>CatalogRef.НематериальныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПередаватьРасходыВДругуюОрганизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияПолучательРасходов</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПередачиРасходов</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НалоговоеНазначение</name>
      <type>
        <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/ChartsOfCharacteristicTypes/СтатьиДоходов/СтатьиДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СтатьиДоходов</name>
  <type>
    <types>CatalogRef.ОбъектыЭксплуатации</types>
    <types>DocumentRef.ЗаказПоставщику</types>
    <types>CatalogRef.НематериальныеАктивы</types>
    <types>EnumRef.АналитикаКурсовыхРазниц</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>CatalogRef.Партнеры</types>
    <types>CatalogRef.НаправленияДеятельности</types>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВыручкаОтПродаж</name>
      <description>Выручка от продаж</description>
      <code>УТ-000001</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
    <items>
      <name>ДоходыПриВосстановленииНалоговогоКредита</name>
      <description>Доходы при восстановлении налогового кредита</description>
      <code>УТ-000009</code>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </items>
    <items>
      <name>ДоходыПриПокупкеИПродажеИностраннойВалюты</name>
      <description>Доходы при покупке и продаже иностранной валюты</description>
      <code>УТ-000007</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ЗакрытиеРезервовПоСомнительнымДолгам</name>
      <description>Закрытие резервов по сомнительным долгам</description>
      <code>УТ-000006</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>КурсовыеРазницыНеоперационные</name>
      <description>Курсовые разницы (неоперационная деятельность)</description>
      <code>УТ-000008</code>
      <type>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
      </type>
    </items>
    <items>
      <name>КурсовыеРазницы</name>
      <description>Курсовые разницы (операционная деятельность)</description>
      <code>УТ-000002</code>
      <type>
        <types>EnumRef.АналитикаКурсовыхРазниц</types>
      </type>
    </items>
    <items>
      <name>ОкруглениеНаличныхПриРозничныхПродажах</name>
      <description>Округление наличных при розничных продажах</description>
      <code>УТ-000010</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>РазницыСтоимостиВозвратаИФактическойСтоимостиТоваров</name>
      <description>Разницы стоимости возврата и фактической стоимости товаров</description>
      <code>УТ-000003</code>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </items>
    <items>
      <name>РеализацияОС</name>
      <description>Реализация ОС</description>
      <code>УТ-000004</code>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределения</name>
    <type>
      <types>CatalogRef.СпособыРаспределенияПоНаправлениямДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорыКредитовИДепозитов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходыПоОбъектамЭксплуатации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоходыПоНМАиНИОКР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЗаполнениеАналитики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

РП/src/Documents/ПереоценкаНМА/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюПечать);
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// МенюОтчеты
	МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	// Конец МенюОтчеты

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриСозданииЧтенииНаСервере();
	
	СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СобытияФормКлиент.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтатьяРасходовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтатьяРасходов) Тогда
		АналитикаРасходовОбязательна = ПризнакОбязательностиАналитикиСтатьи(Объект.СтатьяРасходов);
	Иначе
		АналитикаРасходовОбязательна = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяДоходовПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтатьяДоходов) Тогда
		АналитикаДоходовОбязательна = ПризнакОбязательностиАналитикиСтатьи(Объект.СтатьяДоходов);
	Иначе
		АналитикаДоходовОбязательна = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец МенюОтчеты

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#Область СтандартныеПодсистемы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтаФорма, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ПланыВидовХарактеристик.СтатьиРасходов.УстановитьУсловноеОформлениеАналитик(УсловноеОформление);
	ПланыВидовХарактеристик.СтатьиДоходов.УстановитьУсловноеОформлениеАналитик(УсловноеОформление);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	АналитикаРасходовОбязательна = ПризнакОбязательностиАналитикиСтатьи(Объект.СтатьяРасходов);
	АналитикаДоходовОбязательна = ПризнакОбязательностиАналитикиСтатьи(Объект.СтатьяДоходов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПризнакОбязательностиАналитикиСтатьи(Статья)
	
	Возврат ЗначениеЗаполнено(Статья)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Статья, "КонтролироватьЗаполнениеАналитики");
	
КонецФункции

#КонецОбласти
